const  data = [
    { url:"ページURL1", title:"猫の大虐殺", body:`
    ## 本書の目的意識
    
    この本は，過去の記録から，その当時の人々のものの考え方を追求する．つまり人々が自己の世界をどう解釈し，どう意味を与え，どう感情を注いだのかを知ろうとする．
    
    哲学者であれ一般人であれ，人々にはある世界観があり，それに従って現実を秩序立てている．たしかに一般人が抽象命題を弄ぶことはないが，具体的な事物や，民話や儀式といった文化が提供するものを相手に彼らは思考しているのだ．
    
    そして，その思考の方法や感情の分類の仕方は，自身の属する文化が提供する枠内に制限されている．しかし彼らはその枠内にありながらも語義の境界線を様々にテストして入れ替え，概念を巧みに操作するのだ．この観点から，ディドロやルソーが抱えた問題は，民話の語り手である農民や猫の虐殺に興じる職人の問題と同列に扱われる．
    
    こうして猫の大虐殺の目次は次のとおりとなる．
    
    
    
    いずれの章においても，文化的制限の元での，もしくは制限を逆に利用した概念操作に焦点は当てられている．
    
    とくにわかりやすい例として『知識の系統樹を刈り整える哲学者たち ―『百科全書』の認識論的戦略―』を見ていこう．
    
    ## 『知識の系統樹』要旨
    
    ディドロとダランベールは『百科全書』で何をしたのか？
    
    知識の中心を哲学とすることで，知識概念を改定し，それによって，知識を聖職者から啓蒙主義者の手にうつすことである．
    
    概念は恣意的である．例えば恣意性については，ミシェル・フーコーが『言葉と物』で論じている中国の百科辞典の例を考えよう．
    
    <div class="italic">
        
    動物は次のごとく分けられる。
    
    - (a)皇帝に属するもの
    - (b)香の匂いを放つもの
    - (c)飼いならされたもの
    - (d)乳呑み豚
    - (e)人魚
    - (f)お話に出てくるもの
    - (g)放し飼いの犬
    - (h)この分類自体に含まれているもの
    - (i)気違いのように騒ぐもの
    - (j)算えきれぬもの
    - (k)駱駝（らくだ）の毛のごく細の毛筆で描かれたもの
    - (l)その他
    - (m)いましがた壺をこわしたもの
    - (n)とおくから蝿のように見えるもの。
    
    </div>
    
    このように恣意的であるにも関わらず我々は概念カテゴリーを自明のものとして普通疑わない．それは概念は思考するよりも前に我々に与えられたものであり，概念なしに考えることはできないからである．それゆえ概念とは，ある時代・地域に独特の，思考を方向づけるある種の枠のようなものだと言える．
    これをフーコーはエピステーメーと呼んだ．
    
    *＜エピステメー＞なる用語によってわれわれの解するのは、或る与えられた時代において、諸々の認識論的形象、科学、そしてときには形式化されたシステムを生み出すさまざまな言説＝実践を統一する諸連関の総体である。*
    
    知識は聖職者に属するものであった．しかし彼らは秩序づけは恣意的であることを自覚していた．それは彼らがあたらしい秩序を世界に押し付けようとしていたからである．
    
    具体的には彼らが百科全書をつくるモチベーションとなったチェインバーズの『百科全書』では知識の系統樹は次のようになる．
    
    しかしこれでは人間の技術・芸術と学問が人間の理性から生じるものだということがわからない．しかも，ディドロが軽視したい形而上学と宗教が，肩入れしたい数学・自然学と対等になっている．
    
    そこで彼らは尊敬するベーコンにならうことにした．ベーコンの分類はおおまかには次の通り．
    
    そして最終的な彼らの分類は次の通り．
    
    彼らの分類はベーコンの分類と似ている．実際彼らは自分たちの系統樹はベーコンのものをなぞっただけだと言って，本当の意図を隠そうとした．																																																																																																																																																																
    
    決定的に違う点は啓示神学の扱いである．ベーコンは自然神学のみを哲学の中に含め，それを不十分なものとした．自然現象の観測から出発し，そこに神の意図を見出して，帰納的に神の存在を証明する自然神学の論法では真のキリスト教の神の認識は得られないとベーコンは考えていた．彼にとって帰納法には限界があった．だから啓示神学は自然神学とは別の樹とし，人間の知識を知力と啓示による2本に分けたのだ．
    
    この考えほどディドロとダランベールから隔たったものはない．彼らは啓示は疑いようもない事実なので，他の全てと同じように理性に従わせることができると考えた．
    
    「*したがって，(ベーコンのように)神学を哲学から分離することは，もともと幹についている若枝を幹からむしりとるようなものである」*
    
    彼らは啓示を哲学に含めることで，自然現象の観察によってもたらされる感覚と思索からうまれる知識が知識のすべてであると宣言したのである．そして自然神学は宗教と等置されるが，啓示神学の周りには，迷信・占い・妖怪・善や悪の霊についての学問といった項目が置かれる．ものごとの位置づけだけでメッセージを伝えているのだ．
    
    最後にダランベールは歴史的論証によってこの仕事を終える．すなわち，まず彼は歴史を文明の勝利，文明を文人の所産と定義する．そして，次にベーコンを起源とするデカルトやニュートンなどの思想家たちは，迫害され軽蔑されながらも，未来の世代の知性のために戦った，という偉人伝風の歴史展望を展開する．偉人には本物の戦争を行った将軍たちもいることをダランベールは認めるが，彼の書きぶりでは知性の歴史以外に歴史はないように見える．そして啓蒙思想家こそ，その後継者なのである．
    
    こうして啓蒙思想家以外に正当な文人=歴史の担い手はいなくなる．
    
    『百科全書』においてディドロとダランベールは，まず知識の系統樹を整理することで経験的基礎をもたない知識を排除し，哲学を中心に置く．すなわち教会が説く教義を追い出し，知識の中心に哲学をおく．そして知識概念の創造者は過去にも未来にも啓蒙主義者であることを宣言するのだ．
    
    
    
    ## 感想
    
    価値は素材ではなく表現形式に宿る．『猫の大虐殺』(原題もそのままでthe great cat massacre)はタイトルだけ見ると，過去にあった珍しい事件について取り扱った素材重視の本(こんな事件があったんですよ，ふーん，だから何？みたいな)に見えるが，そうではない．主眼は，史料として残ったさまざまな事件・文書の意義は概念の操作・改変にあること，概念の操作・改変を一般人でも知識人でも(意識的，無意識的に)同じように行っていたこと，を複数の具体例を通して主張することにある．
    
    この意味で概念工学に通じるものがあるので，そちらもぜひ見てほしい．
    
    どの章でも史料を丁寧に読み解くことで何がいえるのかを考えていくスタイルになっているので，ダーントンの解釈がテキストから妥当か否かを考えながら読むことができる．一般向けの歴史書は，もとの史料に何が書いてあったか詳しく精読することはほとんどなく，解釈の結果と注で出典が述べられるくらいだが，そういう既成のストーリーを聞かされることに飽きてきたらこの本を非常にオススメする．文章はとても読みやすいし，各章(それぞれ50p前後で1,2時間あれば読める)を独立して読んで問題ない．
    
    岩波現代文庫版ではここで紹介したディドロの第5章と第3章が削除されているので，買うとしたら岩波書店版を買うのがいいと思う．特にディドロの第5章では紹介の通り概念改変の具体的なプロセスが最もわかりやすく示されているから．しかしどちらも絶版で中古品の流通も少ない．
    
    <div class="hidden">
    
    責任概念を例にモチベーションを説明
    
    知識概念分析の実例　概念分析というものがどういうものなのかを本文に即して
    
    猫の大虐殺の序章の最後のページ
    
    ルソーの例
    
    感想として猫の大虐殺でやっているようなやりかたが哲学的な概念分析よりも力をもつであろうことを主張する
        
        具体的にどの過去を対象にこれを実践するのか，これは恣意的になるがどの過去を選んでも本質的な価値は変わらないだろう．本書では18世紀のフランス人をターゲットにしている．
        
        人々にはある世界観があり，それに従って現実を秩序立てて思考する．それは哲学者も一般人も変わらない．たしかに一般人が抽象命題を弄ぶことはないが，具体的な事物や，民話や儀式といった文化が提供するものを相手に彼らは思考するのだ．
        
        そして人々の個人的な感情の分類や事物の解釈の仕方は，自身の属する文化が提供する枠内に制限されている．しかし彼らはその枠内にありながらも語義の境界線を様々にテストして入れ替えることができる．
        
        このように本書では知識人と一般人を，ある文化の制限のもとで思考するもの，その制限内で概念を巧みに操作するものとして同列に扱う．この観点ではディドロやルソーが抱えた問題は，民話の語り手である農民や猫の虐殺に興じる職人の問題と同じなのだ．
        
        とくにわかりやすい例として『知識の系統樹を刈り整える哲学者たち ―『百科全書』の認識論的戦略―』を見ていこう．
    
        人々の個人的な感情の分類や事物の解釈の仕方は，自身の属する文化が提供する枠内に制限されている．` },
    { url:"ページURL2", title:"タイトル2", body:`ここでは現代哲学の主要なテーマである，言語論・行為論・認識論のうち，行為論と認識論を紹介し，その過程で，哲学の基本的な手法である概念分析とは何かを知識分析を通して理解し，最終的に哲学とはどういう営みなのかを考えたい．(言語については論理学を扱う項で部分的に扱う．言語論に興味がある人は『言語哲学大全1』がオススメ．1以外は読んでいません．)

    参考にした本は
    
    概念工学宣言　心の哲学入門　それは私がしたことなのか　の3冊
    
    入門としてオススメなのは心の哲学入門．概念工学宣言は戸田山の項だけでも十分，心理学の方の記述はやや散らばっている．それは私がしたことなのか，は批判的な読みの格好の材料なので，別のところで書いた．
    
    # 行為論
    
    行為論の中心問題は，能動的な行為が単に受動的な自然現象とどのように 異なるかを示すことにある．[https://www.jstage.jst.go.jp/article/jpssj/53/2/53_133/_pdf]
    
    その始まりをつげたのは，20世紀の哲学者ウィトゲンシュタインが提示した次の問いである．
    
    *私が手をあげるという事実から，私の手があがるという事実を差し引いたとき，後に残るのは何か？*
    
    直観的な回答は，そこに手をあげようと思う意思，能動性があるかどうかだろう．例えば，腕に電極を差し込まれて外部から電気刺激が筋肉に送られることによって手があがったのなら，それは物理法則に従って勝手に生じた単なる運動・出来事であり，手をあげる，という行為ではない．
    
    我々は行為に対しては責任を問うが，出来事に対しては責任を問わない．これが，行為論を考える1つの大きな意義である．
    
    例えば交通事故での加害者の責任は，その事故に加害者の意図がどれだけ関与しているか，その事故の発生がどれだけ加害者の行為と言えるのかに依存している．
    
    例えば彼が飲酒運転していたとき．このとき彼は誰かを轢こうという故意があったわけではないが，飲酒が事故を避けるために要する能力を損ねることを知りながら酒を飲んだわけなので，彼には轢いてしまうかもしれないけどまあいいやという未必の故意(犯罪事実に対する確定的な認識・認容はないものの、その蓋然性を認識・認容している状態)があったとみなされる．これは過失(ある結果を認識・予見することができたにもかかわらず　注意しなかったこと)よりも大きな責任を取ることになる．つまり責任の大きさとしては故意>未必の故意>過失>無過失となる．例えば，もらい事故，典型例としては信号待ちで停止中に追突されるケースにおいて，追突された側は無過失とされる．追突された人にとって，この事故はおきたのであって，おこしたのではないのだ．(意図)
    
    しかし，このように行為・意思概念と責任概念を結びつけることは，正当・適応的なのだろうか．
    
    正当というのは，神経科学や心理学の知見が明らかにしたように我々はそれほど自分の行為をコントロールできるわけではないし，それほど熟慮注意の上で行為を行っているわけではないからだ．だから我々の行為は常に過失をはらんでいる．では我々のほとんどが過失責任をとったことはない．なぜかと言えば，過失があっても，事故が実際に起きる確率は非常に低いからだ．つまり，過失責任が生じる本質的な原因は，過失をしたことではなく，事故が実際に起ってしまったことである．どれだけ過失をしていても，運よく事故が起きなければ責任をとらなくていいし，ほんの少しの注意散漫でも運悪く子供が飛び出してくれば責任をとることになる．もちろん，過失が大きいほど，事故を起こす確率は高めるわけだが，運が大きく絡む問題を，過失・意図を理由として責任を負わせることは正当なのだろうか．(概念工学)
    
    適応的というのは，例えば自動運転が発展していけば誰の行為ともいえない原因で事故は起こりうるし，そもそも自己の行為の責任はすべて行為者にあるという自己責任の考えは我々の社会を幸福にしているのだろうか．(概念工学)
    
    (これについては無過失責任という概念がすでにでている．wiki https://ja.wikipedia.org/wiki/%E7%84%A1%E9%81%8E%E5%A4%B1%E8%B2%AC%E4%BB%BBにわかりやすくまとめられているのでぜひ参照してほしい．)
    
    そこで，行為や意図について考えるのが行為論である．
    
    
    
    # 認識論
    
    認識論の目的は，二つある．一つは知識，信念，証拠，正当化，説明，理解などの「知ること」に関連する様々な概念に定義を与えること．つまり「知識とは何か」という形式に答えること．一つはそれを踏まえて，よりよい知識・信念体系を得るために組織だった方法を提案すること．「知性改善」(概念工学)
    
    認識論に限らず，Xとは何かという問いに対しては，概念分析が行われる．概念分析は，ある概念の必要十分条件を与えることを目標とする．その際には(基本の段階では)具体例と，それに対する我々の概念的直観を根拠として進める．
    
    例えば，知識の古典的定義は次の通り．つまり次の3つをすべて満たすことが「Sはpを知っている」と我々が言うとき意味していることである．これをJTB(Justified true belief = 正当化された真なる信念)形式と呼ぼう．
    
    Sはpを知っている ⇔　Sはpと信じている(B) & pは真である(T) & Sはpと信じるに足る証拠を有し，それを信じている(J) 
    
    例えば(B)(T)だけでは知っているとは言えないのは次の例を考えれば分かる．例えば競馬で万馬券を当てた人がいたときに，なぜその勝ち順になるのかわかったのですか，と聞いて「今日はとても太陽が眩しかったので，この勝ち順になると思いました」と答えれば，彼はこの勝ち順になることを信じていたし(B)，それも正しかったが(T)，我々は彼が勝ち順を予測できていたとは思わない．なぜなら太陽がとても眩しかったというのは正当な証拠とは見なせないから．過去のデータからとか，今日のパドックを歩く様子を見て，とかもっとそういうまともな理由が必要だと思う．だからこの場合，彼はたまたま当たったのであり，当てたのではないと我々は考えるだろう．そこでこの概念的直観を根拠にして，(J)の条件が必要となる．
    
    このJTB形式に，さらに具体例をあげて，この定義が不十分であることを主張できる．その代表例がゲディア問題である．
    
    【ゲティア問題】スミスが知るかぎりジョーンズが所有する車はずっとフォードである．この間ドライブに誘われたときも彼はフォードに乗っていた．ここからスミスは「ジョーンズはフォードに乗っている」という信念を形成し，さらにここから「ジョーンズはフォードに乗っている，または，ブラウンはバルセロナにいる」という命題を演繹し信じた．(これは「または」の導入で論理的に正しい)この演繹以外にスミスはブラウンがバルセロナにいるという根拠を何一つ持っていなかった．ブラウンは普段ニューヨークにいたし，旅行を頻繁にする方でもなかったのだ．
    
    ところが，ジョーンズが実際に乗っている車はトヨタであり(スミスが見ていたのはレンタカーだったのだ)，ブラウンはほんとうにバルセロナにいた．
    
    このとき，JTB形式に従うと「ブラウンはバルセロナにいる」ということをスミスは知っていたことになる．正当化は根拠のある信念「ジョーンズはフォードに乗っている」からの演繹であることによるし，実際に真であるし，スミスは信じていた．しかし我々の直観は，「スミスは知っていたか？」にノーというだろう．ゲティア問題において，「または」の導入が正当な証拠を作るものとは見なせないことが問題である．しかし，正当化された知識から演繹によって新しく知識を得ることは認められる必要があるように思われる．
    
    こうしてJTB形式ではない知識の定義が必要となる．詳細な議論は省略するが，その一つは(J)の条件を次のように変えることである．
    
    【信頼性条件】Sの信念pは信頼の置けるプロセスで形成された
    
    ここで問題にしたいのは，この信頼性条件が正しいかどうかではなく，この条件はもともとJがもっていた「根拠のある証拠をを信じている」という主体が根拠を意識することをもはや求めていない，という点で我々の概念的直観から離れているということである．
    
    これについてもキース・レーラーがTheory of Knowledge (1990)で示したMr. Truetempの例で見てみよう．
    
    Suppose a person, whom we shall name Mr. Truetemp, undergoes brain surgery by an experimental surgeon who invents a small device which is both a very accurate thermometer and a computational device capable of generating thoughts. The device, call it a tempucomp, is implanted in Truetemp’s head so that the very tip of the device, no larger than the head of a pin, sits unnoticed on his scalp and acts as a sensor to transmit information about the temperature to the computational system of his brain. This device, in turn, sends a message to his brain causing him to think of the temperature recorded by the external sensor. Assume that the tempucomp is very reliable, and so his thoughts are correct temperature thoughts. All told, this is a reliable belief-forming process. Now imagine, finally, that he has no idea that the tempucomp has been inserted in his brain, is only slightly puzzled about why he thinks so obsessively about the temperature, but never checks a thermometer to determine whether these thoughts about the temperature are correct. He accepts them unreflectively, another effect of the tempucomp. Thus, he thinks and accepts that the temperature is 104 degrees. It is. Does he know that it is?
    
    ある実験的な外科医が、非常に正確な体温計であり、かつ思考を生み出すことのできる計算装置でもある小型の装置を発明し、トゥルーテンプ君と名づける人が脳手術を受けたとする。この装置（tempucompと呼ぶ）は、トゥルーテンプ氏の頭に埋め込まれ、その先端はピンの頭ほどの大きさで、頭皮に気づかれることなく、温度に関する情報を脳の計算システムに伝達するセンサーとして機能する。そして、この装置が脳にメッセージを送り、外部センサーが記録した温度について考えるように仕向けるのである。テンプコンプは非常に信頼性が高いので、彼の思考は正しい温度の思考であると仮定する。つまり、これは信頼性の高い信念形成プロセスなのだ。さて、最後に、彼はテンパコンプが脳に挿入されたことを知らず、なぜ温度についてこんなに執拗に考えるのかについて少し困惑しているだけで、温度に関するこれらの考えが正しいかどうかを判断するために温度計をチェックすることはないと想像してください。しかし、その温度に関する考えが正しいかどうか、温度計で確認することはない。彼はそれを無反省に受け入れている。このように、彼は気温が104度であると考え、それを受け入れている。そうである。彼はそれを知っているのだろうか？
    
    https://faculty.fordham.edu/nballantyne/truetemp.html
    
    この例はTB,信頼性条件を満たしているのでMr. Truetempは気温を知っていることになる．が「彼が気温を知っている」と我々は見なせるのだろうか．
    
    こうして知識概念の分析は最初は我々の概念的直観を明晰に言語化することを目標に進められたものの，徐々に我々の素朴で日常的な直観とは離れた定義を採用していくこととなる．これはそのように知識概念を捉えるほうが，他の学問との整合性がとれたり，第二の目標である「知性改善」に役立ったりするからである．
    
    # 概念工学へ
    
    一般に概念分析を我々が何を考えているかを明らかにすることだけに限定する必要はないし，概念の真の意味は我々が素朴に考えている通りのことだと考える必要もない．これについては行為論の責任概念でも述べた通り，我々のもつ概念には，進化的・歴史的な起源があり，そのときには正当性・適応性があっても，すでに有効でなくなっている場合があるからだ．概念分析においては，我々がもつ素朴概念をとりあえずの正解として，これを明晰に言語化することも一つの目標としていいが，その概念をより良いかたちに変えていくのも，目標とすべきことである．
    
    概念工学とは，概念を自動車や発電機や医薬品といったものと同じく人間社会が創りあげた人工物とみなし，工学が有益な人工物を設計するように，人類にとって重要な概念を創造・改定する営みである．(例えば人権という概念は我々が幸福に暮らすのにどれだけ大きな役割を果たしただろう？)そして，その視点で見ると，概念工学こそ哲学が今までやってきたことであり，今後も哲学がおこなう(べき)ことだといえる．
    
    # 感想
    
    とは言っても，我々の言葉にできない曖昧な概念を直観に合う形で明晰な言葉で表現するという限りでの概念分析もとても面白い．具体例としては，「お前が言うな，非難の哲学」　https://repository.kulib.kyoto-u.ac.jp/dspace/bitstream/2433/245550/1/cap_11_1.pdf
    
    は非難・偽善性についての概念分析で，テーマのセンスが良く，非常に明晰で具体例も豊富でわかりやすく，分析哲学の面白さがつまった論文である．ぜひ見てほしい．
    
    また，概念を明晰にする活動を行わないまま，概念工学をすることはまま行われることであり，むしろそういう活動が概念を改変するメインの活動だったのではと感じられるのが『猫の大虐殺』である．
    
    
    ` },
    { url:"ページURL3", title:"タイトル3", body:`---
    layout: layouts/post.njk
    ---
    
    # 心理療法
    
    1つの図で表すと・・・
    
    https://www.rational.org.nz/prof-docs/women&depression.htm
    
    ![img](https://www.rational.org.nz/misc/images/Causation%20diagram.gif)
    
    行動変容法を先に扱う理由は，
    
    - 動物の調教にも応用ができること
    - 
    
    # 行動変容法
    
    行動とはなにか？
    
    - 行動はなんらかの機能を有している．それが非適応的であっても，なんらかの目的にはかなっている．
    
    - 行動のパターンは外部から観察可能な環境(先行事象と結果事象)との相互作用の結果として(意識的であれ非意識的であれ)学習されたものである．
    
    - 行動は頻度，持続時間，強度などの観点から定性的・定量的に測定できるものである．それゆえ，介入により改善したかどうかを判定することができる．
    
    - 行動はラベリングではない．例えば「彼は怒っている」は行動につけられた名称である．「彼は，母親に対して大声を上げ，二階に駆け上がり，自分の部屋のドアを強く閉めた」ならば行動である．
    
      
    
    
    
    扱う行動はオペラント行動とレスポンデント行動の2つに分かれる．
    
    問題となる行動のほとんどはオペラント行動であり，行動変容法のほとんどの技法はオペラント行動を変容させるためにある．
    
    ## オペラント行動
    
    オペラント条件付けとは，ある状況における報酬や嫌悪刺激に適応して，自発的にある行動を行うように，学習することである．そしてその行動がオペラント行動である．
    
    例としては，レバーを押して餌がでてくればレバーをもっと押すようになるし，レバーを押して電流が流れば，レバーを押さなくなる，というのがオペラント条件付けで，レバーを押す，押さないという行動がオペランド行動である．
    
    ![www.verywellmind.com/thmb/sa-p88Nqjpv5t4dp0EjpZ...](https://www.verywellmind.com/thmb/sa-p88Nqjpv5t4dp0EjpZMC_eec=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/2794863-operant-conditioning-a21-5b242abe8e1b6e0036fafff6.png)
    
    オペラント行動は先行事象(Antecedents),オペラント行動(Behavior),結果事象(Consequences)のABCで理解できる．
    
    ### BCだけで
    
    まずはAについては考慮せず，BとCの関係だけを考えると，次の3つに分類できる．ここで好ましい結果事象=報酬をC+ ,望ましくない結果事象をC-と書くことにしよう．
    
    正の強化 = Bをしたときに C+ を与えて Bを増やす
    
    負の強化 =  Bにしたときに 今存在するC-をなくして Bを増やす
    
    正の弱化 = Bをしたときに C- を与えて Bを減らす
    
    負の弱化 = Bをしたときに 今得られているC+をなくして Bを減らす
    
    消去 = Bをしたときに 今まで得られていたC+を与えないことで Bを減らす. 
    
    分かりづらいと思うのでネズミの例で説明しよう．
    
    ### ネズミの例
    
    正の強化 = レバーを押したら，新たに餌を与える
    
    負の強化 = レバーを押したら，すでに流していた電流を止める
    
    消去 = レバーを押しても，(今までは与えていた)餌をもう与えない
    
    正の弱化 = レバーを押したら，電流を新たに流す．
    
    負の弱化 = レバーを押したら，(今享受している)餌を取り上げる．
    
    となる．
    
    このように消去では行動の結果，得られていたはずの報酬が得られず，なにも起こらない．与えないだけで，今何かを奪うわけではない．
    
    負の弱化では，行動の結果，今得ている報酬が奪われる．それは負の強化で，いま得ている嫌悪刺激が奪われるのと同じである．
    
    ### 効果的にするには
    
    強化を有効にするためには，(正の強化を例にする)
    
    - 即時性，報酬を行動のすぐに与える必要がある．時間が経てば，何に対する報酬なのか分からない．
    - 随伴性, つまり行動が起きたときだけ報酬を与える．行動してもしなくても報酬が生じるなら，行動は強化されない．
    - しかし，行動に対して報酬を必ず毎回与える必要はない．むしろ報酬を与えるかどうかにランダム性を加えるほうが効果は高まることが知られている．(例えば行動Bを平均して10回行ったときに一回報酬を与えるが，それぞれの頻度は5回とか13回とかバラバラにする)
    
    消去で注意すべきは消去バースト，自発的回復である．消去バーストとは，消去によって行動の頻度や持続時間，強度が一時的に増大することである．自発的回復とは，消去された行動がしばらく経った後，再び出現することである．
    
    例えば大学生Kは毎朝校門近くの自販機でコーヒーを買う．これはお金を自販機に入れると(B)コーヒーが飲める(C+)という正の強化を受けていると解釈できる．ある日，お金を入れたのにも関わらず，何も出てこなくなったとしよう(消去)．このときKは何度もボタンを押したり，自販機をバンバン叩いてみるも結局無駄でコーヒーは得られなかった(消去バースト)．それから一週間はコーヒーをそこで買うことはやめたのだが，ふとお金を再びその自販機に入れてみた(自発的回復)．そのときも，同じくコーヒーは出てこなかった．こうしてKは二度とそこでコーヒーを買うことをやめた．
    
    効果的な弱化のためには，強化と同じく即時性と随伴性が大切である．しかし，弱化には特有の副作用が存在する．例えば，弱化においては，嫌悪刺激を与える人にも与えられる人にも負の強化が生じうる．
    
    まず嫌悪刺激を与えられる人について．嫌悪刺激が与えられる場合(正の弱化)この嫌悪刺激から逃げることができるのであれば，この逃避行動により，嫌悪刺激をなくすことができるので，負の強化を受ける．つまり弱化を受けた人は，逃避行動を強化されるのだ．
    
    つぎに嫌悪刺激を与える人について．例えば，自分が好まない行動を誰かがしたときに，それを弱化(例えば何らかの罰を与える)によって，弱めれば，弱化によって好まない行動がなくなるという報酬が得られるため，負の強化を受ける．それゆえ，弱化の使用が過剰になってしまうかもしれない．
    
    弱化には副作用が多く，特に嫌悪刺激を用いることになる正の弱化は専門家の間では最後の選択肢とみなされる．負の弱化の代表例としてはタイムアウト(問題行動をおこしたときに，短時間，正の強化子に触れる機会を奪うこと．例えば，幼児が危険な遊びをしたときに幼児をベビーベッドに10分間隔離する．)がある．
    
    タイムアウト→ https://parenting-ed.org/wp-content/themes/parenting-ed/files/handouts/timeout.pdf
    
    ### Aの導入
    
    同じ行動であっても強化，消去，弱化のうちどれが起きるのかは文脈依存的であることに気づけば，先行事象(A)が果たす重要性が理解できる．つまり，例えば直進するという行動は，赤信号のときと青信号のときで，別の結果事象をもたらすだろう．
    
    再び，ネズミがレバーを押す状況を考えよう．例えばライトを導入する．ここで赤いライトがついているときにネズミがレバーを押せば，餌を与え，緑のライトがついているときには，ネズミがレバーを押しても，餌を与えないとしよう．するとネズミは赤いレバーのときにしかレバーを押さなくなる．
    
    このように行動が強化されたときに存在していた先行事象を，弁別刺激(SD discriminative stimulus)と呼ぶ．一方，行動が強化されないときに存在していた先行事象を，非強化先行刺激(SΔ)と呼ぶ．
    
    赤いライトがSDであり，緑のライトはSΔである．
    
    特定の先行事象を提示したときに，オペラント行動の確率が上がれば，その行動は先行事象の刺激性制御を受けているという．
    
    先行事象は般化(generalization)されうる．つまり，SDと似た先行事象でも行動を示しうる．
    
    例えば自傷行動を示す高度の知的障害児Aを例に取ろう．
    
    Aは母親が部屋にいると，四つん這いになり床に頭を打ち付ける．そうすると，母親がやってきてAを抱き上げ話しかけるという報酬を与える．これで自傷行動は強化される．
    
    一方，部屋に姉がいるときにはAは自傷行動をしない．なぜなら，それをしても姉は何もしてくれないからだ．ここから母親の存在はSD,姉の存在はSΔである．
    
    ここでAが入院して，そばに女性看護師がいたとしよう．これはSDと類似している．そこでAが四つん這いになり床に頭を打ち付けたとき，彼女はAを母親と同じように，抱きしめ話しかけたとしよう．こうしてSDは般化されていき，誰か大人がいれば自傷行動をするようになるかもしれない．
    
    ## レスポンデント行動
    
    レスポンデント条件づけは，無条件刺激(US)に，中性刺激(CS)を対提示することを繰り返すことで，CS単独でも，無条件反応(UR)と似た条件反応(CR)を引き起こすことである．UR,CRがレスポンデント行動である．
    
    パブロフの犬を例に取った分かりやすい説明がすでにあるので，そちら https://saikolodsm.com/respondent-conditioning/ を参照．汎化，消去，自発的回復なども見てほしい．
    
    では，オペラント行動とレスポンデント行動の違いはなにか．
    
    レスポンデント行動は，「生物学的基礎」をもつ「生理的な身体反応」で，オペラント行動は強化などによる「学習された行動」である．つまりレスポンデント行動は自分の意思とは関係なくおこる反応で，オペラント行動は学ばれた行動である．これら2つは一つの状況下でどちらも生じることがあるが，それが反応なのか行動なのかを意識すれば区別することができる．
    
    例えば，工場員Fの目の間には，機械があって，この機械は作業中に時々，Fに空気を吹き付ける(US)ためFはそのたびに目をつぶってしまう(UR)のだが，機械はその前にクリック音(CS)を鳴らす．このUSとCSの対提示により，Fはクリック音(CS)を聞くと必ず目をつぶってしまうようになった(CR)．(レスポンデント条件づけ)
    
    次第にFはクリック音を聞くと(A)，頭を横にそらすこと(B)を覚えた．これにより，空気はFの目には吹き付けられなくなる(C+)．それゆえ，頭を横にそらす行動は正の強化をうけ，クリック音のたびに頭を横にそらせば，クリック音(CS)と目への空気の吹付け(US)の対提示がなくなる．こうしてFはクリック音を聞いても目をつぶらなくなる．これはレスポンデント行動の消去である．
    
    問題になるのは，多くの場合行動であって，生理的な反応ではない．生理的な反応が問題になるのは，例えば不安症や恐怖症である．
    
    
    
    ## あたらしい行動を形成する方法
    
    ### シェイピング
    
    シェイピングは，強化と消去を組み合わせて，獲得したいオペラント行動(標的行動)に漸近的に接近することである．
    
    例えば水族館のイルカやシャチは複雑な芸を学習しているが，これらの複雑な行動を行わせるためにシェイピングを活用できる．
    
    オペラント行動を強化する上での問題になるのは，行動を強化するためには，その行動が実際に発生する必要があるということだ．行動が発生しないと報酬が与えられず，ゆえに強化はできない．しかし，例えば輪をくぐるとか，飛び上がってボールにタッチする，ような複雑な行動が，自然に生じることはない．
    
    そこでシェイピングである．その行動の実行のためには，いくつかのステップを経由すればいいことに注目する．
    
    例えばスキナー(skinner 1938)が行った実験を再現しよう．この実験では，30cm四方の実験箱のなかにいれた実験用ラットにレバーを押させるためにシェイピングを利用した．オペラント条件づけの項で，ラットがレバーを押せば，餌を与えたり，電流を流したり，という実験を紹介したが，これを行うためには，ラットがレバーを押す必要がある．しかし，ただラットを箱に入れただけでは，ラットはレバーを押そうとはしない．そこで，「レバーを押す」を標的行動とし，そのために漸近的に接近するために，7つのステップに分解した．
    
    ここで1つ目のステップは，自然にラットが実行することだろう．ラットがたまたま，レバー側に移動すれば，報酬を与え，その行動を強化する．そしてその行動が十分に強化されれば，たまたまレバーの方向に頭を向ける可能性が高くなるだろう．そこでこれが実行されたときに報酬を与えることにする．同時に，ただレバー側にいるだけではもう報酬は与えない．これで2の行動が強化されるとともに，1の行動は消去される．あとは同じで，次の行動を強化しながら，前の行動は消去する．各ステップの行動は，次のステップの行動が自然に発生する確率が高くなるようなものを選ぶ必要がある．最後まで到達すればラットはレバーを押すことを学習する．
    
    例えば，イルカを調教するときにも話は同じである．このとき，効果的な強化のためには即時性が必要だったことを思い出そう．つまり，行動のすぐに報酬を与えなければ，その行動を正しく強化することができない．しかしイルカが水面からはねたときに，即座に餌を上げることなどできない．そこでトレーナーはホイッスルを活用する．つまり，餌(UR)とホイッスル(CR)を対提示することで，ホイッスル自体が報酬反応(CS)を引き起こすようにするのだ．こうすれば，任意のタイミングで，即座の報酬を与えることができ，正しく行動を強化できる．
    
    意図せずシェイピングしてしまう場合
    
    例えば母親が仕事をしているとき(A)に子供Vは，遊ぶようにせがみ(B)，母親は遊んでやっていた(C+)．母親はこの行動に困っていたので，消去することとした．遊ぶようにせがんでも(B)，遊んでやらないことにしたのだ(C+を与えない)．そこでVは消去バーストを起こし，泣き叫んで走り回った(B')．母親は心配になってVを抱きしめた(C'+)．つぎにVが母親に遊ぶようにせがんだ(B)ときも，母親は無視したのだが(C+を与えない)，やはりVは消去バーストをおこして，泣き叫んで走り回る(B')．母親はやはり心配になってVの相手をした(C'+)．これはBを消去して，その近似行動であるB'を強化していることと等しい．
    
    こうして，Vは遊ぶのを断られると，いつも泣き叫んで走り回ったが，母親はそれに慣れてきたため，その日は無視した．するとVは，走りながら壁にタックルし，床をダンダンと蹴り始めた．近所迷惑になることを恐れた母親はVの相手をすることにした．これは，さらに悪い近似行動を強化してしまっている．
    
    このように，意図しないままシェイピングが行われ，より悪い行動が強化されていくことで，問題行動が悪化する場合がある．
    
    # 問題行動の分析方法
    
    問題行動の分析はオペラント行動の原理であるABC
    
    A どんなとき(誰といる？どこにいる？その前に何をしていた，された？)に問題行動は生じるか．逆にどんなときには生じにくいのか．
    
    Bどんな行動? 
    
    
    
    C 問題行動のあとに何が起きる?(何を得る?何を避ける?)
    
    
    
    
    
    # 認知行動療法
    
    ![img](https://www.rational.org.nz/misc/images/Causation%20diagram.gif)
    
    
    
    ![Cognitive behavioral therapy - basic tenets.svg](https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Cognitive_behavioral_therapy_-_basic_tenets.svg/280px-Cognitive_behavioral_therapy_-_basic_tenets.svg.png)
    
    ## 認知行動療法の基本的な考え方
    
    行動変容におけるABCのみですべてが説明できるわけではない．例えば，同じ事象が起きても，人によってそれが報酬とみなされる場合もあれば，そうでないとみなされる場合もある．どう感じ，どう行動するのかは，事象の解釈によって変わる．そして事象の解釈は，世界をどう認識しているかというcore beleifから影響を受ける．生物学的な要因と，生育・発達の経過がcore beleifをつくる．
    
    非適応的な認知と行動のパターンに気づき，修正することを目標とする．
    
    もっとも簡単に気づくことができる，自動思考から始め，より根源的なcore beliefを認識する，という流れで説明していこう．
    
    ## 自動思考(automatic thoughts)
    
    - ある特定の状況において即座に引き起こされる思考(内的独白)
    - 感情や生理的な反応を伴う
    - 自分にとっては合理的で筋が通っているように見える
    - 特定の行動を引き起こす
    
    例) 
    
    学校の廊下で友人Aとすれ違ったときに，自分は挨拶をしたのに友人Aからは返事がなかった(特定の状況)
    
    このとき「Aに嫌われてしまったのだ，自分は何か気に障ることをしたのかもしれない」と思い(内的独白,自動思考)
    
    心臓がドキドキして，悲しく不安な気持ちになってきて(生理的反応・感情)
    
    Aをなんとなく避けてしまうようになった(特定の行動)
    
    同じ状況でも，単にAは何か考え事をしていたのだろうとか，遠くて声が聞こえなかったのだろう，と考える人なら，このような反応は起こらないだろうから，自動思考が，感情や行動に影響を与えているのは明らかだろう．
    
    そこで，この状況に応じて勝手に即座に浮かんでくる非適応的な思考を修正することが認知行動療法における一つの目標となる．
    
    しかし，単にもっと前向きなことを考えよう，信じようとしても，うまくいかない．自動思考は自分にとっては合理的な解釈だからだ．
    
    そこで，なぜこのような自動思考が生じてしまうのかを考えることが重要になる．認知行動療法において最も大切なのは，後述するように，自分の心の動きを意識し，観察し，考え，正しく認識することである．思考の変化はその結果として可能になることである．
    
    例えば，自動思考が生じたとき，その根拠は何なのかを考えてみる．例で言えば，なぜAに嫌われたと考えるのか，Aが気づかなかっただけという解釈よりもこの解釈のほうがあり得るものだと考える根拠は何か．例えば，挨拶したときAとは確実に聞こえるくらい近い距離にいたこと．一方，何かこの解釈を反証する点はあるだろうか．例えば，Aは以前にも挨拶を無視したが，その後もAは普通に自分と接していたとか．このように，根拠や反証を考えていけば，自動思考が可能な唯一の解釈だという確信が薄れていく．自動思考に感じる合理性がなくなってはじめてもっと適応的な解釈を採用することができる．
    
    自動思考の改善の1つの流れとしては，
    
    - 非適応的な自動思考の発生に気づく
    - それがどんな感情や行動をもたらしているかに気づく
    - なぜその解釈をするのか根拠と反証をあげる
    - より適応的な可能な解釈があるかを考える
    
    となる．
    
    こうして，自動思考について考えを巡らせる習慣がつけば，色々な自動思考に共通の自分に存在する，認知の歪み(cognitive distortions) https://ja.wikipedia.org/wiki/%E8%AA%8D%E7%9F%A5%E3%81%AE%E6%AD%AA%E3%81%BF に気づくことができるかもしれない．そのためには，自動思考を記録・整理しておくことが必要だろう．
    
    https://www.hofu.link/products/myphp4.php?&stamp=Permission&no1=12&no2=11&tno=8&seal=Approval&pg=1&w=1
    
    ## core belief・スキーマ
    
    いくつかの自動思考に共通のパターンを取り出すことができれば，問題の根本にある自分の基本的な世界認識，すなわちcore beliefとかスキーマと呼ばれるものに気づくかもしれない．
    
    これは，保護者など周りの人とのかかわり合いや経験した重大な事件(離婚，死別，事故など)から若年期に獲得されるものであり，それゆえ個性・人格を特徴づけ，修正は容易でない．生育発達の状況と，生物学的な条件が組み合わさって非適応的なものになりうる．
    
    ここでは，パーソナリティ障害の治療を目的に生まれたスキーマ療法を参考にして話を進めよう．
    
    例えば，
    
    どんな人でも，いずれ私を見捨てて私から離れていってしまうだろう
    
    という見捨てられスキーマ(**Abandonment Schema ** Young,1990)がある．
    
    このようなスキーマに対する応答としては，回避・降伏・過保障がある．
    
    回避は，スキーマが活性化する状況を避けることで，例えば，人との親密な関わりを避ける．そうすれば見捨てられるかもしれない，と思う状況は生じない．
    
    降伏は，スキーマに完全に応じることで，例えば交際している人がいなければ私は誰からも愛されてないことになると信じきって，一人でいるときには「誰も私を愛してはいないんだ」という自動思考を受け入れる．
    
    過補償は，スキーマを恐れて反撃行動や過剰に補正することで，例えば，交際相手なら常に連絡を取りあって，互いの要求には完全に答えないといけないと考え，少し連絡への返信が遅いだけで「相手は自分から離れようとしている」という自動思考を生じる．
    
    こうして自動思考や認知の歪みは，スキーマとスキーマに対する応答から生じるものだと理解でき，根本にあるスキーマの修正を目指す．
    
    その方法の基本は，スキーマを正しく認識することであり，これは自動思考のときと同じである．例えば，スキーマの長所と短所をリストアップしたり，スキーマの妥当性を考えたりなど．他にはロールプレイ・再体験によって頭だけでなく実感を伴った気づきを獲得させようとすることもある．
    
    また別の特徴として，幼少期に満たされなかった中核的感情欲求がスキーマの原因と捉えて，この欲求を治療者とクライエントの治療関係の制約内で満たそうとする「治療的再養育法」や，患者がそのスキーマを保持している 理由に十分に理解を示しつつ、スキーマを変化させる必要性を患者に認識させる「共感的現実検討」を用いる．
    
    https://www.kwansei.ac.jp/cms/kwansei_i_industrial/2021/pdf/ronsyu48-kato.pdf
    
    # ACT
    
    認知行動療法では，認知を修正することを目的としていたが，認知や感情は私とは関係なく勝手に起こるものであり，それはそれで受け入れて(Acceptance) ，自分の価値・望む人生の方向を設定しそれにコミットした行動をとる(Commitment)というもの．マインドフルネスにも近い．詳しくはwikipedia参照．
    
    https://ja.wikipedia.org/wiki/%E3%82%A2%E3%82%AF%E3%82%BB%E3%83%97%E3%82%BF%E3%83%B3%E3%82%B9%26%E3%82%B3%E3%83%9F%E3%83%83%E3%83%88%E3%83%A1%E3%83%B3%E3%83%88%E3%83%BB%E3%82%BB%E3%83%A9%E3%83%94%E3%83%BC
    
    
    
    # メンタライゼーション
    
    こうして
    
    直接説明することはなかったが，精神分析についても基本は意識することが苦痛で無意識領域に抑圧された欲望を，色々な技法により表面化させ，意識させることで症状の改善をもたらす，ということである．
    
    すべてに共通した
    
    
    
    
    
    # 関連
    
    - オープンダイアローグ https://ja.wikipedia.org/wiki/%E3%82%AA%E3%83%BC%E3%83%97%E3%83%B3%E3%83%BB%E3%83%80%E3%82%A4%E3%82%A2%E3%83%AD%E3%83%BC%E3%82%B0
    
    メンタライゼーションを自然な形で教えることで症状の改善に役立っているのかも知れない．
    
    - 愛着理論
    
    
    
    # 参考書籍
    
    行動療法
    
    メンタライゼーション
    
    スキーマ療法 → https://www.kwansei.ac.jp/cms/kwansei_i_industrial/2021/pdf/ronsyu48-kato.pdf
    
    認知の歪みなど→　https://www.simplypsychology.org/cognitive-therapy.html
    
    行動療法と認知療法の繋がりについても感じられる良いスライド→ https://madeinheene.hee.nhs.uk/Portals/19/2016%20Basic%20Psychological%20Treatments%20-%20CBT%20-%20SRM.pdf
    
    
    
    ACT精神分析オープンダイアログ(クライエント中心療法　メンタライジングp21にとても似ている)とかどんな療法も根本的にMentalizing 
    
    良い小説とはなにか　明示的なメンタライジングを促進することである　もう一つはあり得る実存を提示することである
    
    
    
    
    
    # ボツ
    
    行動療法の始祖であるスキナーが批判していたものはなにか？あまり読んでいないけどおそらくは，正確な現実認識を妨げる言葉使いについて批判していたのでは．
    
    https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6701252/
    
    
    
    
    
    次のようにself , other , futureへの考え・期待で整理されることもある．
    
    私は何の価値もない人間だ(self)
    
    誰も私を愛さないだろう(other)
    
    ずっと今のようなひどい状況が続くのでなんの希望もない(future)
    
    ## Assumptions , rule for living
    
    いろいろ発生する自動思考に気づけば，自動思考のパターンが見えてくる．
    
    
    
    また，思考が感情をうみ，行動が思考をうみ，感情が行動をうむ，というように，3つは相互に結びついている．このように，人の思考(current thinking)や感情や行動と相互に結びついていて，根本には世界をどう認知しているかがある(core beleif)というのが，である．
    
    とくに，適応的でない認知にスポットライトを当てて，
    
    - 自動思考である
    - 認知の歪みが生じている　適応的でない
    - 根本には世界認知モデルがある
    
    という観点から，より適応的になることを目指すのが認知行動療法．
    
    まず，自動思考
    
    ` },
]

export default data;